In [1]:
import pandas as pd

In [3]:
# reading the csv file
df = pd.read_csv(r'D:\py with DA\Python-with-data-analysis\dataset\StudentsPerformance.csv')
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1 Selecting one column

## 1.1 Syntax 1

In [ ]:
# select a column with []
df['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: str

In [7]:
# check out the data type of a column
type( df['gender'])

pandas.Series

In [9]:
# series: attributes and methods
df['gender'].index
df['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: str

# 1.2 Syntax 2

In [10]:
# select a column with .
df.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: str

In [11]:
df.math_score

AttributeError: 'DataFrame' object has no attribute 'math_score'

In [12]:
df['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

# 2 Selecting two or more columns

In [13]:
# selecting two columns using [[]]
df[['gender', 'math score']]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [14]:
# check out the data type of the selection
type(df[['gender', 'math score']])

pandas.DataFrame

In [15]:
# selecting two or more columns using [[]]
df[['gender', 'math score', 'writing score']]

     gender  math score  writing score
0    female          72             74
1    female          69             88
2    female          90             93
3      male          47             44
4      male          76             75
..      ...         ...            ...
995  female          88             95
996    male          62             55
997  female          59             65
998  female          68             77
999  female          77             86

[1000 rows x 3 columns]

In [ ]:
# we can't select 2 or more columns with the "."
# df.'gender', 'math' -> error

# 3 add new column to a data frame

## 3.1 Adding a new column with a scalar value

In [16]:
# adding new column to dataframe
df['language score'] = 70

In [17]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70
996,male,group C,high school,free/reduced,none,62,55,55,70
997,female,group C,high school,free/reduced,completed,59,71,65,70
998,female,group D,some college,standard,completed,68,78,77,70
999,female,group D,some college,free/reduced,none,77,86,86,70

# 3.2 Adding new column with array

In [18]:
import numpy as np

In [20]:
# create an array of 1000 elements
language = np.arange(0,1000)

In [22]:
# Adding new column to dataframe
df['language score'] = language
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,4
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,995
996,male,group C,high school,free/reduced,none,62,55,55,996
997,female,group C,high school,free/reduced,completed,59,71,65,997
998,female,group D,some college,standard,completed,68,78,77,998
999,female,group D,some college,free/reduced,none,77,86,86,999

In [23]:
# create random integer numbers [1,100]
language = np.random.randint(1,100, size = 1000)

In [25]:
df['language score'] = language
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,40
1,female,group C,some college,standard,completed,69,90,88,29
2,female,group B,master's degree,standard,none,90,95,93,5
3,male,group A,associate's degree,free/reduced,none,47,57,44,43
4,male,group C,some college,standard,none,76,78,75,47
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,86
996,male,group C,high school,free/reduced,none,62,55,55,49
997,female,group C,high school,free/reduced,completed,59,71,65,19
998,female,group D,some college,standard,completed,68,78,77,14
999,female,group D,some college,free/reduced,none,77,86,86,84

In [27]:
# min and max
min(language)
max(language)

np.int32(99)

In [28]:
# create random float [1,100]
np.random.uniform(1,100, size = 1000)

array([ 3.82049789, 88.56430514, 84.36440979, 25.82223707, 57.41987713,
       77.42916176,  1.45764559, 33.70489825, 73.90630744, 15.83024224,
       80.35352554, 70.11534807, 39.06113453, 94.99725378, 46.61158147,
       86.81423686, 28.81021142, 97.75947135, 57.06672336, 13.0661265 ,
       75.26219113, 66.5249798 , 71.91571552, 61.39912151, 43.48440451,
       91.64562438, 67.40606624, 56.4901151 , 16.22067993,  3.95189906,
       79.61058677, 69.65169   , 27.26785467, 87.60335669, 31.35625323,
       65.68615966, 45.07348177, 63.56331623, 40.06922242, 44.48186132,
       51.17390356, 16.63068044, 82.93220536, 82.64459626, 23.28836992,
       20.95406351, 17.58897765, 92.32780253, 31.60094832,  8.6222086 ,
       88.31717573, 45.25301294, 28.80880637, 54.09915871, 75.57211634,
       41.90103166, 35.11470103, 39.80828933, 34.63451579, 92.40343293,
       88.86436313, 88.42313952, 73.5053643 , 67.59894441, 89.9412666 ,
        5.216195  , 67.10559139, 48.96016966, 49.29311532, 91.69007336,
       11.12515559, 87.49136255, 36.42979114, 55.79187947, 64.08708499,
        3.99440134, 95.49778912, 64.77803192, 73.84347996,  6.76232812,
       44.61258479, 49.81601489, 37.81779548, 57.074201  , 47.20781538,
       46.69576555, 85.0965026 ,  4.63706004, 92.89513148, 29.43639352,
       96.08958577, 29.48812396, 87.25581548, 29.8717315 , 30.90110888,
        8.63221762, 58.86776853, 88.93082061, 63.27479475, 38.47079687,
        8.07837391, 32.0356402 , 16.16719619, 33.23602709, 18.87878528,
       50.44575281,  4.95752737, 37.51628958, 12.10416695, 40.4151608 ,
       93.37305674, 19.76482459, 48.90714842, 57.626458  , 55.53473293,
       78.14758678, 51.77494862,  9.40126397, 41.21743111, 15.97909748,
       76.83495449, 99.43594797, 89.27461458, 95.09015356, 25.73637931,
       87.63633814, 93.87220776, 87.55153605, 34.36671128, 42.34386299,
       14.65731317, 88.29959936,  1.8741128 , 67.87337506, 18.60088525,
       44.26491725, 10.85756328, 27.0280945 , 72.69162925,  9.67326431,
       28.72759224, 57.90709147, 24.77865474, 42.11607423, 47.35929646,
       25.45942678, 94.71078501, 34.00061027, 37.07470937, 73.3174815 ,
       74.11455637, 88.6107179 , 15.12380105,  5.72043593, 72.09890877,
       53.46128171, 36.00456549, 72.0619465 , 92.80806371, 51.03019035,
       86.10210767, 85.8865847 , 50.20071064, 87.92744537, 35.31202087,
       98.21346196, 11.28380715, 62.55357719, 67.87764808, 88.63698351,
       85.01250718, 98.95186627, 26.97752706, 96.60462068, 64.7164867 ,
       81.94353967, 24.92473536, 50.350185  , 43.98688495, 46.57297105,
       24.69712916, 58.44442924, 11.619514  , 80.73360935, 93.20342945,
       56.13823318, 64.79090226, 79.44854292,  5.02555282, 95.96043621,
       76.72693405, 20.16035146, 30.41612383, 95.34593583, 90.7605516 ,
       26.60159498, 37.59787616, 45.86213289, 48.44969973,  9.76542631,
       95.0985393 , 13.16463436,  3.82691859, 52.88926842, 56.19677422,
        6.22003435, 10.73518717, 80.85241191, 38.58813373, 26.65542214,
       21.74983572, 22.56296106,  7.77820475, 31.96566881, 29.06826855,
       77.69145396, 12.14365031, 49.9208376 , 93.9757908 , 31.80161868,
       96.60947055, 36.24558858, 16.67289811, 69.0389172 , 82.48835284,
       42.45410541, 79.67826767, 42.49409814, 27.16992615, 68.7409502 ,
       30.76638035, 19.99992974,  4.4901218 , 97.93695661, 28.34108157,
       62.09547592, 82.11008127,  5.5219207 , 60.78704681, 18.47418912,
       27.68970652, 35.71208883, 37.70923598, 38.0246831 , 73.07645421,
       29.52189772, 51.62100623, 50.77128182, 33.38991733, 53.93814567,
       72.64456735, 47.68045412, 13.87869217, 45.80656835,  5.2750447 ,
       72.28561338, 93.74832839, 14.15248002, 46.82947114,  1.05723786,
       17.42267075, 22.06350926, 84.54228054, 68.18319785,  3.10026078,
       77.67551363, 81.56597912, 84.55337154, 88.07361628, 97.34350586,
       55.01929944, 38.4216403 , 54.23090674, 39.64609228, 36.23710811,
       47.1773673 , 47.77116164, 53.4652405 , 39.80295875, 36.37830693,
       87.75404909, 83.75030711, 93.43637437, 12.30993425, 17.31773331,
       75.23428781, 45.72554866, 64.93340643, 98.57426311, 63.41260371,
       65.86806341, 64.51488007, 80.65050151, 69.29162062,  9.2851959 ,
       55.62270136, 41.31183685, 71.41906136,  9.43850437, 96.81300799,
       50.84813772, 91.07209865, 13.94814041, 16.87227833, 23.88933447,
       75.59019642, 98.74127112, 37.57489547, 12.76998069, 69.01415295,
       40.57066603, 27.10970954, 57.7560748 , 10.4492444 , 30.49458641,
       96.73148257,  3.12526453, 48.31813482, 46.94220507, 80.54510873,
       85.79748366, 16.4904631 , 83.31976697, 68.51679366, 99.14513783,
        1.14227892, 23.00180285, 65.92818758, 26.80104538, 76.2373887 ,
        3.19089942, 80.32416624,  1.93026361, 42.54046076, 37.40584475,
       69.80084095, 27.82033244, 67.37701982, 66.22277526, 30.7640035 ,
       87.89429259, 33.0690417 , 13.25819528, 33.68187516, 15.92880238,
       46.78405521, 37.70688529, 45.86480816, 89.9391218 , 38.8368286 ,
       44.67080004, 85.08307948, 38.58002441, 33.66053638, 67.74059216,
       24.27917603, 49.44603772, 83.28912102, 82.33105136, 34.28386361,
        8.88597669, 28.20474378, 31.3910887 , 31.13664665, 59.53210752,
        7.79432684, 72.69841911, 95.99471234, 55.48990935, 85.72311961,
       22.75377637, 99.56028237, 70.68877088, 92.76277314,  8.23369812,
       16.06607551, 93.86030911, 57.9018538 , 30.08073611, 10.08170341,
       25.56687915, 79.62378826, 72.93386179, 79.23514245, 89.07719296,
       43.39033828, 19.67280983, 43.08792629, 32.15349588, 16.57941137,
       69.33563295, 18.66192679, 22.35860604, 50.8143492 , 15.50336952,
       60.90102154, 81.08077131, 86.36362322, 43.68968641, 98.94748808,
       15.58973342, 25.95851316, 36.27349768, 57.34714472, 97.42555411,
       34.89239302, 59.07226724, 98.90133105, 19.41088481, 59.78466194,
       97.98052557, 87.14307982, 49.4752529 , 65.53264522,  6.16036288,
       36.33836385, 43.07849993, 63.98894056, 88.0980127 , 50.16521258,
       24.32762163, 58.74428076,  4.26726219, 68.43550532, 56.01645664,
       12.83582806,  1.49686692, 67.03005908, 15.95606505, 41.09677229,
       69.66467302, 10.62740341, 94.68857075, 77.18307359, 55.42525483,
       66.40755634, 98.1826178 , 54.58138523, 14.85638074, 29.49589249,
       50.97953811, 79.59986548, 94.92913634, 39.43844718, 92.43679855,
       95.61632378, 19.93785131, 56.7568816 , 41.84883013, 11.26180249,
       61.89197471, 15.89421623,  6.85361427, 12.14942241, 95.5620006 ,
       36.55528446, 56.30532055, 94.44573376, 88.59940379, 50.23635929,
       76.40010195, 45.67981622, 46.78100836, 83.59365542, 97.9790016 ,
       44.45128025, 97.76136707, 40.56100371, 48.16806533, 22.36889497,
       35.61241291, 85.20932462, 58.15112266, 51.93069977, 79.13782221,
       75.33965276,  6.37088777, 79.18814665, 57.45732613, 16.41339737,
       47.67892489, 36.01695708, 61.46427933, 49.47761013, 20.05618391,
       99.27670655, 54.28332435, 96.62309824, 23.85795192, 99.62116978,
       65.92185249, 66.07743371, 62.15872721, 20.48550313, 82.77013943,
       79.12364314, 69.61365101, 42.24967769, 19.71931879, 11.4025744 ,
       12.3907739 , 64.69776515, 39.60859338, 39.82705982, 96.57138984,
       79.57096491, 95.3462973 , 92.83947217, 75.73588511, 11.01043849,
        7.24167028,  5.2671593 , 27.48202494, 60.54110926, 39.93568733,
       92.14367827,  3.9675959 , 42.50274265, 38.64836205, 61.83648698,
       99.04773036, 57.82397638, 96.24610057, 65.31771081, 60.50413756,
       76.57233871, 41.14910588, 53.00550492, 34.53440255, 55.9527948 ,
       95.02706655, 55.37549276, 42.47171285, 90.29767059, 54.15824573,
       10.33302848, 66.37995017, 57.85108003, 37.38116976, 31.00611524,
       58.11245827, 73.26793528, 67.10239704, 64.45834703,  5.24544977,
       50.80071548, 67.48437536, 47.34656082, 11.68459848, 82.25683742,
       74.72056019, 34.20035153, 48.37071086, 93.32525375,  9.29533476,
       35.66155463, 10.21958715, 46.34633383,  9.93855363, 43.4568481 ,
       62.27333551, 99.80622332, 90.35963163, 68.58872526, 54.71803895,
       76.16711587, 90.63272335, 78.64273568, 23.64075403, 10.97656036,
       52.79042637,  4.06592641, 97.64679704, 19.92559883, 96.79421606,
       18.53273022, 74.71083961, 48.58687418, 20.00769535, 18.70963888,
       54.77711484, 79.54679448, 85.19536416, 64.85488532, 68.94278563,
       72.57281764, 52.42100349, 17.82600314, 74.35462375,  5.34072351,
       73.43399031, 21.25224114, 23.5016671 , 29.75443975, 59.88195744,
       89.30966761, 41.38110465, 27.27899166, 25.84984077, 15.8957906 ,
        4.6099711 , 48.48622339, 37.52502135,  5.8596585 , 64.97475331,
       30.20338563, 37.12427847, 22.18638299, 29.09111472, 21.46083439,
       85.6512446 , 80.47931012,  2.29413955,  8.35715112, 84.38147282,
       38.30275829, 12.13821161, 98.37532195, 48.64035524, 82.89558341,
       78.83659784, 69.90295921, 85.90173718, 96.24130774, 49.87724627,
       38.31384189, 99.71396608, 70.78763905, 47.69616947, 30.56869742,
       53.00812881, 67.17932573, 22.21867972, 47.21896219,  5.86292566,
       86.03496176, 79.7282912 , 60.11150059, 34.67971937, 41.08886604,
       91.68177012,  5.29864285,  4.30025018, 15.62485736, 95.84222047,
       11.9720258 , 25.4279597 , 71.85672106, 77.49402457, 84.18140471,
       65.94679391,  2.55722285, 89.77533106, 82.08135976, 59.08380577,
       82.5667808 , 49.41263191, 71.83938056, 32.09289044, 43.74212357,
       54.25816966, 92.192565  ,  7.69243186, 83.84616164, 94.01886043,
       20.51116773, 23.49989703, 68.32946389, 88.39219608, 66.42134108,
       10.54255832, 87.55790323, 65.39454413, 35.75617521, 87.35540174,
       80.13762421,  1.02672261, 20.54848634, 46.23935732, 50.87707798,
       59.83494664,  7.5321033 , 49.58593258, 54.79205285, 99.09777477,
        6.95107844, 74.49442451, 71.33715696, 91.53718505, 34.72142161,
       18.7287385 , 53.45998094, 22.03523604, 38.19202432, 38.28999188,
        3.04650462, 94.3642195 , 39.63019067, 69.10823461, 42.97293367,
       51.00032517, 59.31756885, 86.37898775, 90.40182635, 98.14292596,
       39.08668831,  2.63297861, 89.65054063, 71.19100178, 24.92797079,
       66.11298517, 27.52861304, 43.25675395, 57.18704786, 75.7397948 ,
       21.50394777, 41.94947648, 62.86484608, 43.85226253, 31.56910763,
       38.24900556, 41.88483891, 81.3379986 , 65.2103997 , 36.06201916,
        5.35527229, 71.47887504, 76.09645854,  6.87724966, 86.09220181,
       87.73232444, 27.34914595, 52.73381758, 60.15556211, 68.33820225,
       48.28153143, 16.58293492,  6.25658033, 75.66415057, 13.84441195,
        3.42398659, 38.26771979, 78.25074668, 93.79480666,  5.51315077,
       47.17499296, 59.2891053 , 64.33044609, 81.08090385, 36.25859012,
       20.08914719,  7.23912038, 43.02507709, 89.56412696, 72.23014691,
       20.89479072, 83.61058863, 15.78352531, 89.17092847, 79.16400404,
       86.89701263, 36.00187844, 57.05537433, 24.28790639, 52.69084125,
       32.21796164, 64.30933492,  8.32966807, 42.72100409, 74.41927157,
       92.66183531, 88.93958981, 17.20491558, 70.77308577, 24.58053545,
       23.95580472, 11.87898507, 35.17616394, 30.74322929, 90.24417314,
       50.69151898, 78.1506043 , 15.2413768 , 40.43339653, 85.90959868,
       88.56081831, 78.60997117, 77.29278154,  9.29988522, 91.6099199 ,
       13.29414359, 81.44009259, 17.08627393, 91.24658585,  7.38284426,
       60.13534582, 53.56457009,  4.78767694, 10.36012344, 63.7981192 ,
       37.53318058, 11.6645666 , 45.56822458, 23.203781  , 79.3829749 ,
       56.204031  , 73.02829711, 99.02073405, 33.16724344, 61.66785915,
       90.22813218, 35.84452267, 41.52503255, 84.73410332, 87.91763467,
       39.60429784, 34.57604546, 31.94334338, 68.30473501, 78.10140949,
       77.70561216, 69.94359623, 30.16697925, 12.05917511, 88.87648351,
       37.10650395, 70.56737959, 12.64831132, 23.768463  , 18.35258951,
       30.28958563,  8.73008215,  4.82766741, 82.55512747, 84.33236991,
       29.87073548, 68.4729486 , 67.47976481, 13.59911843,  5.49904275,
       27.47775328, 60.0581467 , 18.6613025 , 92.64367639,  9.48471831,
       97.98156797, 82.04423144, 11.15487568,  8.9538791 , 71.16625342,
       14.6143139 , 97.54251507, 91.76783579, 92.47803385, 17.32011109,
       73.97021836, 61.96829   , 97.10227027, 37.61092902,  7.14570843,
       94.70246872, 54.73597715, 35.83750506, 45.62331412,  1.2452659 ,
       78.98742849, 20.73159053, 51.2723009 , 20.79346966, 32.98042745,
        9.73123343, 22.99883145, 81.54443912, 13.37664641, 24.71672638,
       21.13558181, 72.12245744, 89.16331619, 63.68487238, 14.8042902 ,
       66.76424007, 29.1201636 , 65.06953509, 84.53019507, 16.45276837,
       22.38850104, 35.65667921, 16.14834097, 88.327547  , 97.36567548,
       77.94538192, 48.53070426, 96.86330893, 40.19953914, 53.49238787,
       83.45604559, 78.02039202, 66.21349158, 54.95459994, 96.40858029,
       64.34616672, 82.81359467, 90.5045568 , 81.74229462, 18.30184718,
       85.13621969, 47.28589092, 31.2024945 , 65.52812325, 58.2545517 ,
       83.46457217, 31.95085604, 85.00661125, 21.56169081, 92.09566419,
       31.86751772, 49.09714904, 53.034482  , 71.00878242,  7.15508414,
        6.77049236, 10.5134063 , 69.76540673, 71.34881991, 90.37318973,
       53.86455914, 79.69629601, 31.12259339, 14.00822136,  3.22385599,
       72.01438048, 84.77135534, 41.29451249, 21.65904081, 83.51240329,
       65.41257577, 35.741743  ,  4.79760172, 24.67555099, 27.67321295,
       15.9817961 , 83.15702831, 46.53951566, 46.85774991, 16.9153687 ,
        9.92972272, 70.33731736, 53.46860187, 89.61493291, 79.45723417,
       32.68841243, 57.25212564, 41.9951905 , 38.4877425 , 38.69979401,
       31.15192918, 41.79510084, 17.72222262, 49.87934266, 71.96676062,
       85.99545522, 15.89348926, 82.87386078, 47.77338293,  2.69662018,
       20.56169905, 86.52783674, 73.80723215, 14.12300939, 52.44977114,
       13.0986405 , 97.91649219,  2.97701702, 32.52946656, 81.0884577 ,
       93.43363636, 24.74468803, 66.74018181, 78.78835398, 95.56616606,
       18.10471413, 79.92803166, 46.4332891 , 26.95122054, 20.37043223,
        9.25649977, 60.38716584, 12.87066558, 33.08587423, 62.77178304,
        2.00223081, 31.99446571, 64.21860484, 73.05460565, 36.3325151 ,
       22.37960946, 50.72130856, 98.08329982, 45.17212404, 37.05607505])